**VIDEO 1**

In [1]:
import pandas as pd

In [2]:
datos = {"nombre": ["Mauricio", "Eugenio", "Beatriz"], "edad": [22, 28, 25]}
datos

{'nombre': ['Mauricio', 'Eugenio', 'Beatriz'], 'edad': [22, 28, 25]}

In [3]:
df = pd.DataFrame(datos)
df

     nombre  edad
0  Mauricio    22
1   Eugenio    28
2   Beatriz    25

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df["nombre"]

0    Mauricio
1     Eugenio
2     Beatriz
Name: nombre, dtype: object

In [6]:
df.nombre

0    Mauricio
1     Eugenio
2     Beatriz
Name: nombre, dtype: object

In [7]:
type(df.nombre)

pandas.core.series.Series

**VIDEO 2**

In [1]:
import pandas as pd
df = pd.read_csv('Precipitaciones.csv')
df.head()

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
0,A CORUNA,240.5,293.4,31.0,80.6,149.5,108.9,44.6,21.8,96.5,154.5,100.8,214.8,1536.9
1,ALBACETE,68.1,28.0,26.2,65.3,25.4,50.0,2.0,34.5,48.0,44.8,33.1,14.1,439.5
2,ALICANTE,49.2,3.7,63.2,85.8,57.2,20.0,9.2,5.0,44.0,41.1,47.4,1.8,427.6
3,ALMERIA,56.3,5.2,35.8,43.1,38.8,16.9,10.2,1.9,17.4,27.3,32.6,3.2,288.7
4,ARABA,96.8,79.9,38.0,52.0,37.7,107.8,8.5,17.7,63.3,38.5,212.2,197.3,949.7

In [2]:
df.head(1)

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
0,A CORUNA,240.5,293.4,31.0,80.6,149.5,108.9,44.6,21.8,96.5,154.5,100.8,214.8,1536.9

In [4]:
df.tail(1)

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
51,ZARAGOZA,52.0,30.0,3.6,52.7,38.3,57.5,13.5,13.2,61.5,27.4,76.6,23.4,449.7

In [5]:
df.shape

(52, 14)

In [6]:
df.columns

Index(['region', 'enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio',
       'julio', 'agosto', 'septiembre', 'octubre', 'noviembre', 'diciembre',
       'anual'],
      dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   region      52 non-null     object
 1   enero       52 non-null     float64
 2   febrero     52 non-null     float64
 3   marzo       52 non-null     float64
 4   abril       52 non-null     float64
 5   mayo        52 non-null     float64
 6   junio       52 non-null     float64
 7   julio       52 non-null     float64
 8   agosto      52 non-null     float64
 9   septiembre  52 non-null     float64
 10  octubre     52 non-null     float64
 11  noviembre   52 non-null     float64
 12  diciembre   52 non-null     float64
 13  anual       52 non-null     float64
dtypes: float64(13), object(1)
memory usage: 5.8+ KB

In [8]:
df.describe()

,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
count,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000
mean,92.996154,78.632692,26.684615,64.500000,38.305769,54.182692,11.840385,17.178846,62.246154,54.373077,82.494231,76.192308,659.626923
std,57.127171,67.454280,31.473913,21.421942,29.079576,36.821635,13.256390,13.939496,28.581205,36.619785,91.689789,80.409042,352.905548
min,26.800000,2.300000,3.300000,3.500000,0.700000,1.100000,0.000000,0.000000,0.900000,1.000000,7.100000,1.800000,108.200000
25%,53.825000,32.825000,9.125000,53.950000,18.875000,26.325000,1.600000,4.850000,46.000000,29.825000,32.375000,22.075000,455.925000
50%,73.950000,62.600000,17.200000,62.700000,35.650000,50.400000,6.150000,16.500000,62.300000,46.550000,46.950000,47.950000,548.550000
75%,97.300000,102.550000,35.425000,77.625000,48.750000,78.025000,17.875000,26.550000,81.625000,74.500000,102.725000,107.000000,665.150000
max,261.900000,335.700000,209.800000,128.400000,149.500000,145.000000,46.800000,57.000000,122.800000,175.700000,384.600000,314.700000,1575.400000

In [9]:
serie = df["region"]
serie.head()

0    A CORUNA
1    ALBACETE
2    ALICANTE
3     ALMERIA
4       ARABA
Name: region, dtype: object

In [10]:
arreglo = [0,1,2,3,4,5,6,7,8,9]
miSerie = pd.Series(arreglo)
miSerie

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [13]:
indices = ["Posicion 0", "Posicion 1", "Posicion 2", "Posicion 3", "Posicion 4", "Posicion 5", "Posicion 6", "Posicion 7", "Posicion 8", "Posicion 9"]
miSerie = pd.Series(arreglo, indices)
miSerie

Posicion 0    0
Posicion 1    1
Posicion 2    2
Posicion 3    3
Posicion 4    4
Posicion 5    5
Posicion 6    6
Posicion 7    7
Posicion 8    8
Posicion 9    9
dtype: int64

In [14]:
type(miSerie)

pandas.core.series.Series

In [15]:
type(miSerie["Posicion 0"])

numpy.int64

In [16]:
cities = {"Mexico": "CDMX", "EUA": "Washington DC", "Canada": "Ottawa"}
atributo = pd.Series(cities)
atributo

Mexico             CDMX
EUA       Washington DC
Canada           Ottawa
dtype: object

**VIDEO 3**

In [18]:
import pandas as pd

In [19]:
serie = pd.Series([1,2,3,4,5])
serie

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [20]:
serie[0] = serie[0] + 5
serie

0    6
1    2
2    3
3    4
4    5
dtype: int64

In [21]:
serie = serie * 5
serie

0    30
1    10
2    15
3    20
4    25
dtype: int64

**VIDEO 4**

In [22]:
import pandas as pd

data = {"idProducto":[1001,1002,1003,1003],
       "cantidadVendida": [30, None, 25, 25],
       "Precio": [20.5, 15.0, None, 22.5]}

df = pd.DataFrame(data)
df

   idProducto  cantidadVendida  Precio
0        1001             30.0    20.5
1        1002              NaN    15.0
2        1003             25.0     NaN
3        1003             25.0    22.5

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   idProducto       4 non-null      int64
 1   cantidadVendida  3 non-null      float64
 2   Precio           3 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 228.0 bytes

In [24]:
df.isnull()

   idProducto  cantidadVendida  Precio
0       False            False   False
1       False             True   False
2       False            False    True
3       False            False   False

In [25]:
df.isnull().sum()

idProducto         0
cantidadVendida    1
Precio             1
dtype: int64

In [26]:
df_eliminados = df.dropna()
df_eliminados

   idProducto  cantidadVendida  Precio
0        1001             30.0    20.5
3        1003             25.0    22.5

In [30]:
valoresNuevos = {"cantidadVendida": 0, "Precio":df["Precio"].mean()}
df_rellenados = df.fillna(valoresNuevos)
df_rellenados

   idProducto  cantidadVendida     Precio
0        1001             30.0  20.500000
1        1002              0.0  15.000000
2        1003             25.0  19.333333
3        1003             25.0  22.500000

In [31]:
df_rellenados["cantidadVendida"] = df_rellenados["cantidadVendida"].astype(int)
df_rellenados

   idProducto  cantidadVendida     Precio
0        1001               30  20.500000
1        1002                0  15.000000
2        1003               25  19.333333
3        1003               25  22.500000